{
  "date": 20151019,
  "image": "http://www.jamahiel.com/public/img/startup.jpg",
  "title": "Developers: The Definitive Guide To Developing Yourself.",
  "summary": "Started from the bottom...",
  "icon": "code",
  "content": [
    {
      "type": "paragraph",
      "text": "I’m in the zone, a few layers deep into my code refactoring. My phone vibrates, dammit. I take a quick look at the number, it’s unrecognised. I'm feeling a bit ominous as to who this could be, but I pick up anyway."
    },
    {
      "type": "paragraph",
      "text": "<em>“Hi, is that Nathan?”</em>"
    },
    {
      "type": "paragraph",
      "text": "<em>“Speaking.”</em>"
    },
    {
      "type": "paragraph",
      "text": "<em>“Hi there, I’m calling from Generic Recruitment Specialists, your CV has <strong>just</strong> come up on my screen!”</em>"
    },
    {
      "type": "paragraph",
      "text": "<em>“Oh.”</em>"
    },
    {
      "type": "paragraph",
      "text": "<em>“Yep, I’m <strong>very keen</strong> to have a chat about a few roles I’m looking at now.”</em>"
    },
    {
      "type": "paragraph",
      "text": "<em>“Uh… Sorry I have to go”</em>"
    },
    {
      "type": "paragraph",
      "text": "<em>*click*</em>"
    },
    {
      "type": "paragraph",
      "text": "This is a pretty regular occurrence nowadays. Recruiters are understandably relentless. But I remember when I was fresh out of university, and would probably have taken any IT related job. In fact, I did, and it was to date the worst professional experience of my life (never work in banking)."
    },
    {
      "type": "image",
      "src": "http://static.standard.co.uk/s3fs-public/styles/story_large/public/thumbnails/image/2014/12/08/12/canarywharf2.jpg",
      "caption": "Don't even think about it."
    },
    {
      "type": "paragraph",
      "text": "Right now I’m in a great role, and looking forward to my next one; where I’ll work less, earn more and have more freedom and influence. So how did I get to a point where I have a real abundance of opportunities to choose from and amazing people to work with?"
    },
    {
      "type": "heading",
      "text": "Disrupt"
    },
    {
      "type": "paragraph",
      "text": "Just doing your job - and only your job time and time again will not elevate your status. Good programmers are at least a tinge lazy, and devs should be spending their time improving and creatively optimising their own workflow to make their own life easier. "
    },
    {
      "type": "image",
      "src": "http://media.viralwriter.com/2013/11/Think-Different.jpg"
    },
    {
      "type": "paragraph",
      "text": "In the past I have worked with people who  give 100%, all day long, fully focused from 9 till 5. It takes a lot of energy - and who wants to have to work like a dog and toil all day long for recognition? Yes, everyone enjoys having a workhorse in their ranks who they can offload their tedious tasks to. But that isn't promotion material. Where devs can concentrate on adding value to any business, is in providing unique insights or going over and above expectations. "
    },
    {
      "type": "quote",
      "text": "Innovate, impress and inspire.",
      "by": ""
    },
    {
      "type": "paragraph",
      "text": "<strong>A great example:</strong> one company I was with had me doing a very tedious content updating task. Basically I was given a list of new assets every week, and I had to go through a number of pages and update the HTML to reflect the changes. This was a horrible and infamously manual process that many before me had worked on, and complained about, time after time."
    },
    {
      "type": "paragraph",
      "text": "I made sure I got the work done, but I also spent approximately half the time building a customised super lightweight CMS in order to automate this whole task. After around a week, I had built something from scratch that made this tedious task pretty trivial, enjoyable even. As part of the process I had also learnt a new language (Node.js) and some new concepts and ways of working. "
    },
    {
      "type": "paragraph",
      "text": "Slowly over time I shared what I’d built with my colleagues and they really liked it. My role changed from performing the updates to supporting the application. But the real gain for me was the impression and perception I’d imposed of being an innovator. When the next project with Node came along you can guess who was first on the list to work on it."
    },
    {
      "type": "heading",
      "text": "Build Stuff"
    },
    {
      "type": "quote",
      "text": "You must have personal projects."
    },
    {
      "type": "paragraph",
      "text": "I build stuff all the time. I have numerous  orphaned experiments, many of which I can’t even remember until the domain comes up for renewal again. <a href=\"http://wll.space\">WLL.space</a> is a good example, but each of the experiments that I’ve produced has taught me more about building, about design, about code and so on. Learning on the job is fine, but it’s not enough to excel - I cannot emphasize this enough, you <strong>must</strong> have personal projects. "
    },
    {
      "type": "image",
      "src": "http://bodyliterate.org/wp-content/uploads/2014/02/minecraft-build.jpeg",
      "caption": "Another pointless, yet amazing project"
    },
    {
      "type": "paragraph",
      "text": "At work, unless you are working on an amazing digital product team like at Spotify or Uber, you are unlikely to be pushing the boundary of your digital or technical knowledge. Usually devs are consigned to delivering whatever project the client needs. If we don’t have personal projects, we are therefore a passenger in our technical development - at the whim of whatever language or framework our superior decides is to be our destiny."
    },
    {
      "type": "paragraph",
      "text": "Building projects is, then, in effect building oneself. Taking charge of the path we want to take and being adept enough that when the opportunity comes, we can take on the work confidently or apply for that job in the area we want without being a total n00b."
    },
    {
      "type": "heading",
      "text": "Visibility, Assertiveness and Communication"
    },
    {
      "type": "paragraph",
      "text": "An oft-quoted problem with developers is their communication skills. Some of my recent findings have been around the power of speaking my mind. I am always trying to push the boundary and provide innovative solutions, but it isn't always the case that I'll be recognised for my very noble work. That’s absolutely fine, because if I don’t communicate the job I am doing then why should anyone else bother to take note?"
    },
    {
      "type": "quote",
      "text": "Challenge, challenge hard and challenge often.",
      "by": ""
    },
    {
      "type": "paragraph",
      "text": "If you have built something, then try and take the time to show it to your colleagues and superiors. If you deserve a promotion, recognise it yourself and proceed to directly ask for it. If there is an issue with your project, like a bad tech decision that could affect you later, challenge it, challenge it hard and do so often."
    },
    {
      "type": "paragraph",
      "text": "When we make our opinion known, people respect us for it. It’s no good grumbling about this or that, if something is wrong, then we need to say it. Honesty and clarity are usually appreciated. Our seniors may not always be so well informed, but they have to make hard decisions anyway. We better enable others to take action on our behalf. "
    },
    {
      "type": "paragraph",
      "text": "Bear in mind, there are some simple nuances; being assertive is not the same as complaining or moaning it’s about clearly communicating our thoughts and wants. Ultimately we can only be respected and influential if we are first providing value at the same time."
    },
    {
      "type": "heading",
      "text": "Move. Often."
    },
    {
      "type": "paragraph",
      "text": "Maybe a bit controversial - but in my experience an essential part of growing is having that diversity of experiences to draw from. I was lucky, when I started working - I was a freelancer. I didn't hand over design work to designers, or database work to back-end guys. I did design, ops and everything in between. This enabled me to have a really good understandding of the whole tech stack before \"fullstack\" was even a thing."
    },
    {
      "type": "paragraph",
      "text": "<blockquote class=\"twitter-tweet\" data-conversation=\"none\" lang=\"en\"><p lang=\"en\" dir=\"ltr\">2 years each at your last two jobs?&#10;&#10;2010:&#10;Unlikeable. Risky hire. &#10;&#10;2015:&#10;Driven. Has in-demand skills.</p>&mdash; Adam Khan (@Khanoisseur) <a href=\"https://twitter.com/Khanoisseur/status/604312494392348673\">May 29, 2015</a></blockquote>\n<script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>"
    },
    {
      "type": "paragraph",
      "text": "Change is almost always a good thing. It is much easier to promote yourself by changing jobs, than it is staying put and trying to convince your existing boss that you deserve one. Companies have structures and hierarchies, and it usually will take pretty exceptional circumstances to move from junior to senior in a short period of time. "
    },
    {
      "type": "image",
      "src": "https://paraphrasinglife.files.wordpress.com/2014/08/no-1-alternative.jpg?w=1500&h=1000",
      "caption": "Adios!"
    },
    {
      "type": "paragraph",
      "text": "You may be in a great job now, but still be on the look out. Nothing lasts for ever, and comfort and complacency will just ultimately stifle growth and innovation. There are a huge variety of problems and different ways of working and soon enough if you stay in the same place too long you may find that the world has actually moved on without you, and the skills you have are not so valuable anymore."
    },
    {
      "type": "heading",
      "text": "Cultivate Good Relationships"
    },
    {
      "type": "paragraph",
      "text": "At the beginning of your working career it may seem like a bit of a pointless thing to do. Suerly the more you know, the further you go? Well that's true, to an extent. Tech jobs are one of the few real meritocracies, but you can only go so far having to prove yourself every step of the way. "
    },
    {
      "type": "paragraph",
      "text": "Later on the value of being simply a great coder begins to wane. You never know where the difficult bosses and rowdy co-workers may turn up in the future. That guy you used to manage 3 years back, he's no CTO of a VC funded started and could soon be offering you the job of your dreams. That boss you told some 'really honest home truths' to before you left, is now working for your client and is sabotaging your proposals - and you don't even know it."
    },
    {
      "type": "quote",
      "text": "That boss to whom you delivered some “Really honest home truths” is now silently sabotaging your proposals."
    },
    {
      "type": "paragraph",
      "text": "Later on the value of being simply a great coder begins to wane. You never know where the difficult bosses and rowdy co-workers may turn up in the future. That guy you used to manage 3 years back, turns out he's now CTO of a VC funded start up and could soon be offering you the job of your dreams. That boss to whom you delivered some “Really honest home truths” before you left, is now working for your client and is sabotaging your proposals - and you don't even know it."
    },
    {
      "type": "paragraph",
      "text": "You can't be best friends with everyone, but leaving a trail of destruction just leaves you exactly where you started everytime you move. So play nice."
    },
    {
      "type": "paragraph",
      "text": "Did you find some great strategies of your own in this article? What are the exciting ways you have been growth hacking your own career?<br><br>\nLet me know in the comments."
    }
  ]
}